src/cf/src/Catalogs/Номенклатура/Номенклатура.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Номенклатура</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Артикул</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бренд</name>
    <type>
      <types>CatalogRef.Бренды</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЕдиница</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесЗнаменатель</name>
    <type>
      <types>DefinedType.КоличествоДолей</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьДатуУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДекларацияСоответствия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Единица</name>
    <type>
      <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
    </type>
  </attributes>
  <attributes>
    <name>Изображение</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзображениеИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Импортер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьУпаковки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МинимальноеКоличествоХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаборУпаковок</name>
    <type>
      <types>CatalogRef.НаборыУпаковок</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьНаПечатьОписание</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>Сорт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияДо</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТемператураХраненияОт</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехническийРегламент</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипНоменклатуры</name>
    <type>
      <types>EnumRef.ТипыНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПополнения</name>
    <type>
      <types>EnumRef.СпособыПополненияЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>ТоварнаяГруппа</name>
    <type>
      <types>CatalogRef.ТоварныеГруппы</types>
    </type>
  </attributes>
  <attributes>
    <name>УсловияХранения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Качество</name>
    <type>
      <types>CatalogRef.КачествоТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>КодСтарый</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЯчейкиСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПоставщика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КодПроизводителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТНВЭД</name>
    <type>
      <types>CatalogRef.КодыТНВЭД</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПоставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтражатьвЛКП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Картинка</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>КартинкаРасширение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧСтикеры</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>СрокХранения</name>
      <type>
        <types>DefinedType.Комментарий</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвойстваНоменклатуры</name>
    <attributes>
      <name>СвойствоНоменклатуры</name>
      <type>
        <types>CatalogRef.ВидыСвойствНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеСвойства</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствНоменклатуры</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Хранение</name>
    <attributes>
      <name>Зона</name>
      <type>
        <types>CatalogRef.ЯчейкиСклада</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТехнологическаяКарта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.НормаРасхода</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕИ</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СоставКомплекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизиты</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Станки</name>
    <attributes>
      <name>Станок</name>
      <type>
        <types>CatalogRef.ПроизводственноеОборудование</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/cf/src/Catalogs/Номенклатура/Forms/ФормаВыбора/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	НавигаторНоменклатуры.ПриСозданииНаСервере(ЭтотОбъект, Истина);
	ПрименитьРежимИерархии();

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Навигатор иерархии - как в форме списка товаров (НавигаторНоменклатуры); панели фильтров у формы нет, помеченные на
// удаление в счётчиках учитываются, как в самом списке.
//

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)

	ПрименитьРежимИерархии();

КонецПроцедуры

&НаКлиенте
Процедура РежимИерархииПриИзменении(Элемент)

	ВидУзла = 0;
	ЗначениеУзла = Неопределено;
	ПрименитьРежимИерархии();

КонецПроцедуры

&НаКлиенте
Процедура УзлыИерархииПриАктивизацииСтроки(Элемент)

	// BSLLS:MagicNumber-off - пятая доля секунды: листание узлов стрелками не дёргает сервер на каждый узел.
	ПодключитьОбработчикОжидания("Подключаемый_ВыбратьУзел", 0.2, Истина);
	// BSLLS:MagicNumber-on

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыбратьУзел()

	Узел = Элементы.УзлыИерархии.ТекущиеДанные;
	Если Узел = Неопределено Или Узел.Вид = ВидУзла И Узел.Значение = ЗначениеУзла Тогда
		Возврат;
	КонецЕсли;
	ВидУзла = Узел.Вид;
	ЗначениеУзла = Узел.Значение;
	ВыбратьУзелНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ИзбранныйРежим(Команда)

	ИзбранныйРежимНаСервере();

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИерархию(Команда)

	ПрименитьРежимИерархии();

КонецПроцедуры

&НаСервере
Процедура ПрименитьРежимИерархии()

	НавигаторНоменклатуры.ПрименитьРежим(ЭтотОбъект, КонтекстСписка(), ОтборыНавигатора());
	ПараметрыЗапроса = Справочники.Номенклатура.ПараметрыЗапросаСписка(КонтекстСписка(), ОтборыНавигатора(),
		РежимИерархии);
	Для Каждого Параметр Из ПараметрыЗапроса Цикл
		Список.Параметры.УстановитьЗначениеПараметра(Параметр.Ключ, Параметр.Значение);
	КонецЦикла;
	НавигаторНоменклатуры.УстановитьОтображение(ЭтотОбъект, КонтекстСписка().Типы.Количество() > 0);

КонецПроцедуры

&НаСервере
Процедура ИзбранныйРежимНаСервере()

	НавигаторНоменклатуры.ПереключитьИзбранныйРежим(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ВыбратьУзелНаСервере()

	НавигаторНоменклатуры.ВыбратьУзел(ЭтотОбъект);

КонецПроцедуры

// Возвращаемое значение:
//  Структура - см. Справочники.Номенклатура.НовыеОтборыПанели: без фильтров, помеченные на удаление - как в списке
//
&НаСервере
Функция ОтборыНавигатора()

	Отборы = Справочники.Номенклатура.НовыеОтборыПанели();
	Отборы.ПоказыватьПомеченные = Истина;
	Возврат Отборы;

КонецФункции

// Подбор с отбором по типу (S7): отбор формы по типу - и состав счётчиков навигатора; у групп тип не заполнен, в
// иерархическом виде отбор спрятал бы группы вместе с содержимым - список плоский.
//
// Возвращаемое значение:
//  Структура - см. Справочники.Номенклатура.НовыйКонтекстСписка
//
&НаСервере
Функция КонтекстСписка()

	Контекст = Справочники.Номенклатура.НовыйКонтекстСписка();
	Контекст.ДляВыбора = Истина;
	Если Параметры.Свойство("Отбор") И Параметры.Отбор.Свойство("ТипНоменклатуры") Тогда
		Тип = Параметры.Отбор.ТипНоменклатуры;
		Если ТипЗнч(Тип) = Тип("ПеречислениеСсылка.ТипыНоменклатуры") Тогда
			Контекст.Типы.Добавить(Тип);
		ИначеЕсли ТипЗнч(Тип) = Тип("Массив") Или ТипЗнч(Тип) = Тип("ФиксированныйМассив") Тогда
			Для Каждого Значение Из Тип Цикл
				Контекст.Типы.Добавить(Значение);
			КонецЦикла;
		Иначе
			// Список значений и прочее - без ограничения счётчиков: отбор формы список всё равно применит.
			Возврат Контекст;
		КонецЕсли;
	КонецЕсли;
	Возврат Контекст;

КонецФункции

#КонецОбласти
